//题目：企业发放的奖金根据利润提成。
//利润(I)低于或等于10万元时，奖金可提10% ；
//利润高于10万元，低于20万元时，低于10万元的部分按10% 提成，高于10万元的部分，可提成7.5 % ；
//20万到40万之间时，高于20万元的部分，可提成5 % ；
//40万到60万之间时高于40万元的部分，可提成3 % ；
//60万到100万之间时，高于60万元的部分，可提成1.5 % ；
//高于100万元时，超过100万元的部分按1 % 提成。
//从键盘输入当月利润I，求应发放奖金总数？
//程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成双精度浮点(double)型。
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
int main()
{
	double i;
	double dxxy1, dxxy2, dxxy4, dxxy6, dxxy10, dxxy;
	printf("你的利润是：\n");
	scanf("%lf",&i);
	dxxy1 = 100000 * 0.1;
	dxxy2 = dxxy1 + 10000 * 0.075;
	dxxy4 = dxxy2 + 20000 * 0.05;
	dxxy6 = dxxy4 + 200000 * 0.03;
	dxxy10 = dxxy6 + 400000 * 0.015;
	if (i <= 100000) {
		dxxy = i * 0.1;
	}
	else if (i <= 200000) {
		dxxy = dxxy1 + (i - 100000) * 0.75;
	}
	else if (i <= 400000) {
		dxxy = dxxy2 + (i - 200000) * 0.05;
	}
	else if (i <= 600000) {
		dxxy = dxxy4 + (i - 400000) * 0.03;
	}
	else if (i <= 1000000) {
		dxxy = dxxy6 + (i - 600000) * 0.015;
	}
	else if (i > 1000000) {
		dxxy = dxxy10 + (i - 1000000) * 0.01;
	}
	printf("提成为：dxxy1=%lf", dxxy);
	printf("\n");

}
